jrjohn/arcana-embedded-stm32/Targets/stm32f103ze/Middlewares/Third_Party/FatFs/src/sd_diskio.c
/**
 * @file sd_diskio.c
 * @brief FatFS disk I/O layer for SDIO SD card on STM32F103
 *
 * Implements the diskio.h interface required by FatFS.
 * - Reads: Polling at reduced SDIO clock (~4MHz) to avoid FIFO overflow
 * - Writes: DMA at full speed (24MHz)
 *
 * STM32F103 shares DMA2 Channel 4 between SDIO TX and RX. Mixing DMA reads
 * and DMA writes causes SDIO DATAEND to not fire for writes (the DMA direction
 * switch leaves the SDIO data path in a broken state). Using polling for reads
 * avoids this hardware limitation entirely.
 */

#include "ff.h"
#include "diskio.h"
#include "stm32f1xx_hal.h"
#include "FreeRTOS.h"
#include "semphr.h"

/* External SD handle — initialized by SdCard driver */
extern SD_HandleTypeDef g_hsd;
extern volatile uint8_t g_sd_ready;
extern SemaphoreHandle_t g_sd_dma_sem;

/* Reduced SDIO clock divisor for polling reads.
 * 72MHz / (17+2) ≈ 3.8MHz — slow enough that the CPU can drain the FIFO
 * via polling even under FreeRTOS interrupt load. */
#define SDIO_CLKDIV_SLOW 17U

/* Fast SDIO clock divisor for DMA writes.
 * 72MHz / (1+2) = 24MHz — maximum Default Speed. */
#define SDIO_CLKDIV_FAST 1U

/* Ensure SDIO hardware and HAL state machine are both ready.
 * HAL_SD_ReadBlocks (polling) leaves SDIO->DCTRL.DTEN set after every read.
 * This blocks subsequent writes. Unconditionally clear the data path. */
static void ensure_hal_ready(void) {
    /* ALWAYS clear SDIO data path before any new operation. */
    g_hsd.Instance->DCTRL = 0;
    __HAL_SD_CLEAR_FLAG(&g_hsd, SDIO_STATIC_FLAGS);
    g_hsd.ErrorCode = HAL_SD_ERROR_NONE;

    if (g_hsd.State == HAL_SD_STATE_READY) return;

    /* Wait up to 1 second for natural completion */
    uint32_t t = HAL_GetTick() + 1000;
    while (g_hsd.State != HAL_SD_STATE_READY) {
        if (HAL_GetTick() > t) break;
    }
    if (g_hsd.State == HAL_SD_STATE_READY) return;

    /* Force-reset: abort DMA, reset SDIO, recover card */
    extern DMA_HandleTypeDef g_hdma_sdio;
    __HAL_DMA_DISABLE(&g_hdma_sdio);
    g_hdma_sdio.State = HAL_DMA_STATE_READY;
    g_hdma_sdio.Lock = HAL_UNLOCKED;

    g_hsd.Instance->DCTRL = 0;
    g_hsd.Instance->MASK = 0;
    __HAL_SD_CLEAR_FLAG(&g_hsd, SDIO_STATIC_FLAGS);

    g_hsd.State = HAL_SD_STATE_READY;
    g_hsd.Context = SD_CONTEXT_NONE;
    g_hsd.ErrorCode = HAL_SD_ERROR_NONE;

    /* Send STOP command to recover card from stuck RECEIVE/DATA state */
    SDMMC_CmdStopTransfer(g_hsd.Instance);

    /* Wait for card to return to TRANSFER state */
    t = HAL_GetTick() + 1000;
    while (HAL_SD_GetCardState(&g_hsd) != HAL_SD_CARD_TRANSFER) {
        if (HAL_GetTick() > t) break;
    }
}

/*-----------------------------------------------------------------------*/
/* Get Drive Status                                                      */
/*-----------------------------------------------------------------------*/
DSTATUS disk_status(BYTE pdrv)
{
    if (pdrv != 0) return STA_NOINIT;
    if (!g_sd_ready) return STA_NOINIT;
    return 0;
}

/*-----------------------------------------------------------------------*/
/* Initialize a Drive                                                    */
/*-----------------------------------------------------------------------*/
DSTATUS disk_initialize(BYTE pdrv)
{
    if (pdrv != 0) return STA_NOINIT;
    /* SD card is initialized by SdCard::initHAL() before FatFS mount */
    if (!g_sd_ready) return STA_NOINIT;
    return 0;
}

/*-----------------------------------------------------------------------*/
/* Read Sector(s) — Polling at reduced SDIO clock                        */
/*-----------------------------------------------------------------------*/
DRESULT disk_read(BYTE pdrv, BYTE *buff, LBA_t sector, UINT count)
{
    if (pdrv != 0 || !g_sd_ready) return RES_NOTRDY;

    for (int retry = 0; retry < 3; retry++) {
        ensure_hal_ready();

        /* Slow down SDIO clock for polling (avoid FIFO overflow under IRQ load) */
        MODIFY_REG(SDIO->CLKCR, 0xFFU, SDIO_CLKDIV_SLOW);

        HAL_StatusTypeDef hal = HAL_SD_ReadBlocks(&g_hsd, buff, sector, count, 5000);

        /* Restore fast clock */
        MODIFY_REG(SDIO->CLKCR, 0xFFU, SDIO_CLKDIV_FAST);

        /* Always clear DCTRL after polling read — HAL_SD_ReadBlocks can leave
         * DTEN set (stuck RXACT) if the transfer partially completes or the
         * data CRC arrives after the HAL timeout. */
        SDIO->DCTRL = 0;
        __HAL_SD_CLEAR_FLAG(&g_hsd, SDIO_STATIC_FLAGS);

        if (hal != HAL_OK) {
            continue;
        }

        /* Wait for card to return to transfer state */
        uint32_t timeout = HAL_GetTick() + 5000;
        while (HAL_SD_GetCardState(&g_hsd) != HAL_SD_CARD_TRANSFER) {
            if (HAL_GetTick() > timeout) break;
        }

        return RES_OK;
    }

    return RES_ERROR;
}

/* Full SDIO + DMA + SD card re-initialization (software power cycle).
 * Called proactively every N writes AND reactively on write failure.
 * Equivalent to HAL_SD_DeInit + HAL_SD_Init + bus width config. */
#define SDIO_REINIT_INTERVAL 400
static volatile uint32_t g_sdio_write_count = 0;

static void sdio_reinit(void) {
    extern DMA_HandleTypeDef g_hdma_sdio;

    /* 1. Full HAL DeInit — resets SDIO peripheral + state machine */
    HAL_SD_DeInit(&g_hsd);

    /* 2. Reset DMA channel */
    __HAL_DMA_DISABLE(&g_hdma_sdio);
    while (g_hdma_sdio.Instance->CCR & DMA_CCR_EN) {}
    __HAL_DMA_CLEAR_FLAG(&g_hdma_sdio,
        DMA_FLAG_TC4 | DMA_FLAG_TE4 | DMA_FLAG_HT4 | DMA_FLAG_GL4);
    g_hdma_sdio.State = HAL_DMA_STATE_READY;
    g_hdma_sdio.Lock = HAL_UNLOCKED;

    /* 3. Re-init SD at 400kHz (identification phase) */
    g_hsd.Instance = SDIO;
    g_hsd.Init.ClockEdge = SDIO_CLOCK_EDGE_RISING;
    g_hsd.Init.ClockBypass = SDIO_CLOCK_BYPASS_DISABLE;
    g_hsd.Init.ClockPowerSave = SDIO_CLOCK_POWER_SAVE_DISABLE;
    g_hsd.Init.BusWide = SDIO_BUS_WIDE_1B;
    g_hsd.Init.HardwareFlowControl = SDIO_HARDWARE_FLOW_CONTROL_DISABLE;
    g_hsd.Init.ClockDiv = 178;  /* 400kHz */
    HAL_SD_Init(&g_hsd);

    /* 4. Re-link DMA */
    HAL_DMA_Init(&g_hdma_sdio);
    __HAL_LINKDMA(&g_hsd, hdmatx, g_hdma_sdio);
    __HAL_LINKDMA(&g_hsd, hdmarx, g_hdma_sdio);

    /* 5. Switch to 4-bit bus + 24MHz transfer clock */
    HAL_SD_ConfigWideBusOperation(&g_hsd, SDIO_BUS_WIDE_4B);
    SDIO->CLKCR = (SDIO->CLKCR & ~0xFFU) | 1U;  /* CLKDIV=1 → 24MHz */
    g_hsd.Init.ClockDiv = 1;
}

/* Expose reinit for external callers (AtsStorageService recovery) */
void sdio_force_reinit(void) {
    sdio_reinit();
    g_sdio_write_count = 0;
}

/*-----------------------------------------------------------------------*/
/* Write Sector(s) — DMA at full SDIO clock speed                        */
/*-----------------------------------------------------------------------*/
DRESULT disk_write(BYTE pdrv, const BYTE *buff, LBA_t sector, UINT count)
{
    if (pdrv != 0 || !g_sd_ready) return RES_NOTRDY;
    if (!g_sd_dma_sem) return RES_ERROR;

    /* Proactive reinit before degradation threshold */
    if (++g_sdio_write_count >= SDIO_REINIT_INTERVAL) {
        g_sdio_write_count = 0;
        sdio_reinit();
    }

    for (int retry = 0; retry < 3; retry++) {
        ensure_hal_ready();

        /* Clear any stale semaphore signal */
        xSemaphoreTake(g_sd_dma_sem, 0);

        if (HAL_SD_WriteBlocks_DMA(&g_hsd, (uint8_t *)buff, sector, count) != HAL_OK) {
            continue;
        }

        /* Wait for DMA + SDIO completion (HAL_SD_TxCpltCallback gives semaphore) */
        if (xSemaphoreTake(g_sd_dma_sem, pdMS_TO_TICKS(5000)) != pdTRUE) {
            continue;
        }

        /* Check for transfer errors */
        if (g_hsd.ErrorCode != HAL_SD_ERROR_NONE) {
            continue;
        }

        /* Wait for card to finish internal programming */
        uint32_t timeout = HAL_GetTick() + 5000;
        while (HAL_SD_GetCardState(&g_hsd) != HAL_SD_CARD_TRANSFER) {
            if (HAL_GetTick() > timeout) break;
        }

        return RES_OK;
    }

    /* All 3 retries failed — full reinit (software power cycle) + final attempt */
    sdio_reinit();
    g_sdio_write_count = 0;
    ensure_hal_ready();
    xSemaphoreTake(g_sd_dma_sem, 0);
    if (HAL_SD_WriteBlocks_DMA(&g_hsd, (uint8_t *)buff, sector, count) == HAL_OK) {
        if (xSemaphoreTake(g_sd_dma_sem, pdMS_TO_TICKS(5000)) == pdTRUE) {
            if (g_hsd.ErrorCode == HAL_SD_ERROR_NONE) {
                uint32_t t2 = HAL_GetTick() + 5000;
                while (HAL_SD_GetCardState(&g_hsd) != HAL_SD_CARD_TRANSFER) {
                    if (HAL_GetTick() > t2) break;
                }
                return RES_OK;
            }
        }
    }

    return RES_ERROR;
}

/*-----------------------------------------------------------------------*/
/* Miscellaneous Functions                                               */
/*-----------------------------------------------------------------------*/
DRESULT disk_ioctl(BYTE pdrv, BYTE cmd, void *buff)
{
    if (pdrv != 0 || !g_sd_ready) return RES_NOTRDY;

    HAL_SD_CardInfoTypeDef info;
    DRESULT res = RES_ERROR;

    switch (cmd) {
    case CTRL_SYNC:
        res = RES_OK;
        break;

    case GET_SECTOR_COUNT:
        HAL_SD_GetCardInfo(&g_hsd, &info);
        *(DWORD *)buff = info.LogBlockNbr;
        res = RES_OK;
        break;

    case GET_SECTOR_SIZE:
        *(WORD *)buff = 512;
        res = RES_OK;
        break;

    case GET_BLOCK_SIZE:
        HAL_SD_GetCardInfo(&g_hsd, &info);
        *(DWORD *)buff = info.LogBlockSize / 512;
        res = RES_OK;
        break;

    default:
        res = RES_PARERR;
        break;
    }

    return res;
}
